[
    {
        "title": "DevOps Engineer II",
        "company": "Ansys",
        "location": "283 Northfield Drive E, Unit 21, Waterloo, ON",
        "description": "Requisition #: 13740\n\n\nWhen visionary companies need to know how their world-changing ideas will perform, they close the gap between design and reality with Ansys simulation. For more than 50 years, Ansys software has enabled innovators across industries to push boundaries by using the predictive power of simulation. From sustainable transportation to advanced semiconductors, from satellite systems to life-saving medical devices, the next great leaps in human advancement will be powered by Ansys.\n\n\nTake a leap of certainty … with Ansys.\n\n\nSummary / Role Purpose\n\nThe Documentation Builds and System Integration team (DBSI) develops and maintains the ecosystem used to author, build, and deploy Ansys product documentation and related content. Our goal is to drive internal productivity and consistent end-user experience via best practices, standardization, and automation.\n\n\nThe DevOps Engineer II supports the development of software products, processes, and supporting systems. In this role, the DevOps Engineer II will collaborate across teams of expert professionals to oversee product documentation infrastructure, builds, tools, and releases.\n\n\nKey Duties and Responsibilities\n\nPerforms all DevOps activities, including the implementation, maintenance, monitoring, deployment, and verification of product builds and packaging to provide quality production builds\nProvides support for builds and VCS for internal customers\nUnderstands and employs industry best practices\nWorks closely with development to adjust builds and packaging to changing product requirements\nAnticipates future needs and technology evolution and proposes and participates in implementation of new solutions\nWorks under the general supervision of a manager\n\n\nMinimum Education/Certification Requirements and Experience\n\nBS in Engineering, Computer Science, or related field with 2 years’ experience or MS\nWorking experience with source code version tools (git) and automated continuous integration software, such as Azure DevOps.\nWorking experience automating build tasks using tools such as Ant, Yaml, etc.\nWorking experience with PowerShell, Python or other scripting language\nWorking experience with XML, structured data development\nWorking experience with JavaScript, HTML, CSS\n\n\nPreferred Qualifications and Skills\n\nWorking experience with XSLT and XPath\nFamiliarity with software documentation tools and authoring practices, e.g., API documentation, structured authoring, Docbook, DITA, Markdown, Oxygen XML, etc.\nWorking experience with search platforms, e.g., Lucene, Solr, Lunr, etc.\nPossesses thorough knowledge of Windows and/or Linux operating systems\nGood communication and interpersonal skills\nProven ability to collaborate with others in a geographically distributed team\n\n\nAt Ansys, we know that changing the world takes vision, skill, and each other. We fuel new ideas, build relationships, and help each other realize our greatest potential in the knowledge that every day is an opportunity to observe, teach, inspire, and be inspired. Together as One Ansys, we are powering innovation that drives human advancement.\n\n\nOur Commitments:\n\nAmaze with innovative products and solutions\nMake our customers incredibly successful\nAct with integrity\nEnsure employees thrive and shareholders prosper\n\nOur Values:\n\nAdaptability: Be open, welcome what’s next\nCourage: Be courageous, move forward passionately\nGenerosity: Be generous, share, listen, serve\nAuthenticity: Be you, make us stronger\n\n\nOur Actions:\n\nWe commit to audacious goals\nWe work seamlessly as a team\nWe demonstrate mastery\nWe deliver outstanding results\n\n\nOUR ONE ANSYS CULTURE HAS INCLUSION AT ITS CORE\nWe believe diverse thinking leads to better outcomes. We are committed to creating and nurturing a workplace that fuels this by welcoming people, no matter their background, identity, or experience, to a workplace where they are valued and where diversity, inclusion, equity, and belonging thrive.\n\n\nTAKE A LEAP OF CERTAINTY IN YOUR CAREER AT ANSYS\n\nAt Ansys, you will find yourself among the sharpest minds and most visionary leaders across the globe. Collectively we strive to change the world with innovative technology and transformational solutions. With a prestigious reputation in working with well-known, world-class companies, standards at Ansys are high – met by those willing to rise to the occasion and meet those challenges head on. Our team is passionate about pushing the limits of world-class simulation technology, empowering our customers to turn their design concepts into successful, innovative products faster and at a lower cost.\n\n\nAt Ansys, it’s about the learning, the discovery, and the collaboration. It’s about the “what’s next” as much as the “mission accomplished.” And it’s about the melding of disciplined intellect with strategic direction and results that have, can, and do impact real people in real ways. All this is forged within a working environment built on respect, autonomy, and ethics.\n\n\nCREATING A PLACE WE’RE PROUD TO BE\nAnsys is an S&P 500 company and a member of the NASDAQ-100. We are proud to have been recognized for the following more recent awards, although our list goes on: America’s Most Loved Workplaces, Gold Stevie Award Winner, America’s Most Responsible Companies, Fast Company World Changing Ideas, Great Place to Work Certified (China, Greece, France, India, Japan, Korea, Spain, Sweden, Taiwan, U.K.).\n\n\n\nFor more information, please visit us at www.ansys.com\n\n\nAnsys is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other protected characteristics.\n\nAnsys does not accept unsolicited referrals for vacancies, and any unsolicited referral will become the property of Ansys. Upon hire, no fee will be owed to the agency, person, or entity.",
        "link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0C_VxUQDhzcEtU5UIQUIXNdycmbXVRtU8htuAzRK_ilEo4NuMdwFH3uFVq2BJmvO4PBVmGp9tWhhWw0mlhVATo9HoT6rVcJ9t1vyY51XuIz77RdK5OE0qUA4Stp49lte0Jl4EMn6Y_XrQdfy21flu-f4HhGZ6KskzitsMvA42rnQYMPrMp8YT9D__duBD7Ld5uCXCYu_jBPchRlOu3YVcXQ6Xa_oU3BUgwY_7KzvAoEp4OhRfbm0qqSNUWFXpwDVyIUOU9bwbjZ7sb51gRiV9CVOHX5MUXdlyfgLHioXgQ_fe_HUz3g0ZsNCOAgOhAn501np9j5YZ6Ro7hkKLql_f-VEXedvh2O09BHTZLF7FKe_evR0pUGWdggwLZggMd1QeAGFtltvUtEhWy_T5EuiF-4zfYk3b37h9NgtODKaG341YJkjzw3peDsHEYPQ0XiA-JZ-gZPu65Yw7GtadWnG1MT9-szU2Zr8GUEBDTE8OKGMLEDYRrn9xjd-r2Rx0rcUG6C_yukxo4FfLtlmTgVAfDibGSA7D4KTj9yqJzVohQ0YHyJd_VSi3C-v0uvFHFvVCnjUTtiPlNi6a6nUZU4Y70M266dVuQi54SsKLDPOu0gVa6UfXRaBe6XI-UCfMZowGu2k2HItBS8KtvmVbQApOsNjKG0xoj1WRs_9y5lV4-nxWkgWUfsuM6Jiw2OHR9OEPwzycU6oMQR5rD7m-WqUDRjzDFeszAOf-QZR3P82QgneNTUWfM9EmvVpkhpMc22HT4J487CMhSpS1bfoxTRLH0jPwsWlqb20XQAEp7UbJ3UnK9hUoRRPv3jD-2Mpq7fwuu8oMSU8jTiyjILSOpKrHdhShL4CXfPNzXpllEKcLOogB37-VpmoKcqi6OIpq6MzDsteVZnz33JbuxVXmA-OmajTJ94uH5WOgbj1TRJvnvVpYnzYja6UylwU2GHT-JNw8uRzbIvajo2DHrBYcxjzKCnL7hyzwB0IXZlSw5sK5yTtJEBu4xBtG0f2rhgEXwbEifI6sWY1N8Yoz2RtOpVkZW9u_yx482DnSGuaEdWXieEWoxjTA2GRr4V0LP3CIBSi0SKt_WO-AtbS02qTbt9AXeWamlqJy2ITL3XfrcvN4VdcDN3PznJQQXNHFtfTUkqv03QSONtld8OTiL5ryUeRjn0hIHFw61wVpXFLWBNOfET1g==&xkcb=SoBO6_M3GvpvheR8XB0LbzkdCdPP&p=0&fvj=0&vjs=3"
    },
    {
        "title": "Software Developer Intern, Summer 2024",
        "company": "Verily",
        "location": "Kitchener-Waterloo, ON",
        "description": "Who We Are\n\nVerily is a subsidiary of Alphabet that is using a data-driven approach to change the way people manage their health and the way healthcare is delivered. Launched from Google X in 2015, our purpose is to bring the promise of precision health to everyone, every day. We are focused on generating and activating data from a variety of sources, including clinical, social, behavioral and the real world, to arrive at the best solutions for a person based on a comprehensive view of the evidence. Our unique expertise and capabilities in technology, data science and healthcare enable the entire healthcare ecosystem to drive better health outcomes.\n\nDescription\n\nVerily’s internship is a paid 13 week program for rising seniors, either undergraduate or graduate students, who are interested in working at the intersection of technology, data science and healthcare. The program is designed for all students, and again this year we encourage students who have been historically underrepresented in this field to explore the program, which is a pathway towards full-time employment within Verily. This includes but is not limited to: Black/African-American, Latinx/Hispanic, Native American, students with disabilities, veterans, and non-binary people.\n\nVerily Canada operates from Google offices in Kitchener-Waterloo and Toronto, and is home to many full-stack software projects. Notable potential project areas relevant to this internship include:\n\nPrecision Health Platform: a modular, composable, and interoperable platform for storage and processing of precision health data across Verily products.\nWorkbench: a scalable, secure research platform, jointly developed by the Broad Institute of MIT and Harvard, Microsoft, and Verily to help biomedical researchers accelerate scientific discoveries.\n\n**Join us for a unique 13 week internship that will take place May 13th to August 9th 2024 OR June 17th to September 13th 2024**\n\nResponsibilities\n\nWork closely with the development team to design, develop, and deliver new software features across the Verily tech stack.\nCome up with ideas to technical design problems, compare options, and propose solutions.\nDevelop using industry-standard tools including GitHub, Google Cloud, Golang, React, Docker, and Terraform to name a few.\n\nQualifications\n\nMinimum Qualifications:\n\nCurrently enrolled in university working towards an Undergrad or Graduate degree in Computer Science or related field.\nAuthorization to work in Canada.\n\nPreferred Qualifications:\n\nPrevious internship or demonstrated experience (i.e. personal projects, volunteer projects, etc) in software development.\nExperience with one or more general purpose programming languages including but not limited to: Java, C/C++, C#, Objective-C, Go, Python, or JavaScript.\nAbility to work independently and collaborate effectively.\nEducation or previous exposure to healthcare or life sciences.\n\nWhy Join Us\n\nBuild What’s Vital.\n\nAt Verily, you are a part of something bigger. We are a diverse team of builders innovating at the intersection of health and technology—united by a shared spirit of curiosity, resilience and determination to make better health possible for all. This builder mindset means your fingerprints will be on the work that shapes the future of health.\n\nFulfilling our precision health purpose starts with the health of our Veeps, which is why we offer flexibility, resources, and competitive benefits to support you in your whole-person well being.\n\nOur culture reflects the behaviors that stem from living our values every day in how we Innovate Healthcare and Technology, Gain Velocity as One Verily, and Respect Individuals. As One Verily, we uphold our collective accountability to sustain this culture and to create a VIBE (Verily’s Culture of Inclusion, Belonging, and Equitability) where all Veeps feel included, a sense of belonging, and have opportunities to grow.\n\nIf this sounds exciting to you, we would love to hear from you.\n\nYou can find out more about our company culture on our LinkedIn Company Page and Verily Careers page.",
        "link": "https://ca.indeed.com/rc/clk?jk=ba48875614054059&bb=ZJSpRUQDQZWME67ddPIQ2Au833o0fOii_0d3SpgcVuT-G1H41j5CV2MAG2Eyazl3&xkcb=SoA567M3Gvpvul2YJ50JbzkdCdPP&fccid=476d93416db83bc2&vjs=3"
    },
    {
        "title": "Electrical Technician/Programmer",
        "company": "CMP Automation",
        "location": "61 Mcbrine Pl, Kitchener, ON",
        "description": "ABOUT CMP AUTOMATION:\n\nCMP Automation is a medium sized, vertically integrated manufacturer of turnkey automation equipment, providing custom manufacturing automation solutions to various industries. Since 1988, we have primarily supplied the automotive industry, in North America and overseas, specializing in small diameter tubing automation.\n\nCMP is considered a leading OEM in the automotive tubing industry, specializing in machine automation for small diameter tubing.\n\nCMP’s strong team of designers and machine builders has a long history in the specialized field of small diameter tube bending as well as broader automation. With our vertically integrated business model, CMP has become an industry leader in several additional areas of specialization. These include material handling systems for the Oil & Gas tube manufacturers, Automotive Seat Assembly Pallets & Conveyor Line Automation and Horticulture Automation.\n\nElectrical\n\nInstall and troubleshoot mechanical, pneumatic, and electronic components of electrical equipment.\nAssemble, install, repair, connect and test wiring, control equipment for electrical systems on new machines.\nPlan installation from electrical schematics, sketches, specifications and installs all electrical and electronic devices.\nDiagnose and troubleshoot faults in electrical/electronic systems and equipment during power up. Repair and replace electrical and electronic components as required.\nTest electrical and electronic equipment for proper function.\nUse computers to setup, tune, and troubleshoot CMP products.\nDrill and tap holes in cabinet or panels using hand tools and power tools.\nMount components on panels, such as transformers, circuit breakers, and switches with bolts and screws, in predetermined order, following drawings, using hand tools and power tools.\nSelect wire, cut, bend and strip insulation from wire ends to fabricate cable, using hand tools, and wire-cutting and stripping machine.\nAffix terminal lugs and other connecting devices to cable-wire ends, using hand tools, crimping machine and soldering equipment.\nCheck components and wiring for shorts or leakage to ground, using electrical-test equipment.\nAdjust clearance of relay & circuit breaker contacts, according to specifications, and using hand tools and feeler gauge.\nBend, cut threads, and install conduit or armored cable, using hacksaw, pipe cutter and conduit bender.\nConnect panel or equipment to power source.\nSwitch on power, and actuate switches and controls in prescribed sequence to determine if it meets performance specifications.\nRequisition materials and supplies as required.\n\nProgramming\n\nUnder the supervision of an experienced Control System Designer, learn to program under company’s programming standards\nDevelop basic programs, perform initial system startup and I/O testing\nProvide thorough testing of machine functionality to verify PLC and Robot program completeness.\nLearning programming language / interface for new product platforms\nTravel, work at customer site for system install, commissioning, support and debug\n\nOthers\n\nRequisition materials and supplies as required.\nAdhere to all CMP Health and Safety rules and procedures.\n\nREQUIRED SKILLS / EXPERIENCE:\n\n1 to 3 years of experience as electrical technician\nBonus: PLC or robotic programming experience\nBonus: Electrical Apprentice or Licensed Electrician (309A or 442)\n\nWE ARE COMMITTED TO PROVIDING:\n\nA dynamic work environment which encourages teamwork, initiative and creativity;\nCareer development and education opportunities;\nA competitive compensation package commensurate with experience, including a benefit package\nExtra-curricular social activities (golf, BBQ’s and many more social events).\n\nJOIN OUR TEAM!\n\nCandidates who are interested in joining our dynamic team are invited to press the apply button and follow the process to submit their resume.\n\nWe thank all applicants; however only those selected for an interview will be contacted.\n\nCMP Automation is an AODA compliant organization, and accommodation is available upon request.\n\nJob Types: Full-time, Permanent\n\nSalary: $25.00-$35.00 per hour\n\nBenefits:\n\nDental care\nExtended health care\nPaid time off\n\nSchedule:\n\nMonday to Friday\n\nSupplemental pay types:\n\nOvertime pay\n\nEducation:\n\nBachelor's Degree (preferred)\n\nLanguage:\n\nEnglish (preferred)\n\nAbility to Commute:\n\nKitchener, ON N2R 1H5 (required)\n\nAbility to Relocate:\n\nKitchener, ON N2R 1H5: Relocate before starting work (required)\n\nWork Location: In person",
        "link": "https://ca.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0APycugqoGq5_ju3jzVBGrk9X0_ksE2yJu3HtjkJn5s61NYKOa2xcc8ZLlVnziNH-_HOp3ouwC5cK3ejl3GdEMDq9Dm9UVC61mK3ef__dnUYE-HfL0enlHogkbwjNOf8jVmUzpk9UISl5Jz0pb_RvXGIe32s09B5gqnZ4dt-eNqZvcdwnM2JoiA2UvQXPlONDP4xAt6CI26NTD1C8MZOp1-qGmaPclUo1DXCpENayRI1-UBHwgcZdGkixf86_2EMZFN5ki-sce4CcldLP77NMeMkI1wR2o4T85kA1n3OT1oa95DTifC7yF2Wd1pe-Jc1jrgkO_62luIjl3ZlJw5N9yJvlL5SrxL5eeXbBIJd4IEa-n-Gk2k6t7Fbiqg3j_RuyjxOaTaBJ4Nm4GtwDyUXKG0p7fl2Jhwhb1tPXLPEeLVn5UGx-Mc8cm2RBpGJMBqMeYKypRSvp8fUAOD4pkZiHFuRh4XK5TZ-6HPrN3IzEovqpCJ-pQ0ZKUIITEGs3UHbJ1mj0AAUFFLtZfs1HBVRdLA6fryIv-Wl7Xb05dNrDUmbIfGu_hjQ3EyFY4YqXbMyRLlIcGkdxGXkA0MH9VLtwuLYMkmgJA0PJv-YKOzYkNPlAVfAPo24HZX&xkcb=SoBn6_M3GvpvheR8XB0JbzkdCdPP&p=2&fvj=1&vjs=3"
    }
]